# 01. Importing Libraries

In [26]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Import Data

In [27]:
path = r'/Users/puchater/Documents/CareerFoundry/Data Immersion/4. Python/17042023 Instacart Bascet Analysis'

In [28]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = 0)

In [29]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled2.csv'), index_col = 0)
#print(df_ords)

# 03. Mixed-Type Data

In [30]:
# Create a data frame.
df_test = pd.DataFrame()

In [31]:
# Create a mixed-type column.
df_test['mix'] = ['a', 'b', 1, True]

In [32]:
df_test.head ()

    mix
0     a
1     b
2     1
3  True

In [33]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [34]:
df_test['mix'] = df_test['mix'].astype('str')

# 04. Missing values

In [35]:
df_prods.isnull().sum()

product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [36]:
df_nan = df_prods[df_prods['product_name'].isnull()==True]

In [37]:
df_nan

           product_name  aisle_id  department_id  prices
product_id
34                  NaN       121             14    12.2
69                  NaN        26              7    11.8
116                 NaN        93              3    10.8
262                 NaN       110             13    12.1
525                 NaN       109             11     1.2
1511                NaN        84             16    14.3
1780                NaN       126             11    12.3
2240                NaN        52              1    14.2
2586                NaN       104             13    12.4
3159                NaN       126             11    13.1
3230                NaN       120             16    14.4
3736                NaN        41              8    14.8
4283                NaN        77              7    14.4
4790                NaN        91             16    14.5
38183               NaN        39             12    20.9
40440               NaN       120             16    14.8

In [38]:
# Addressing Missing Values
df_prods.shape

(49693, 4)

In [39]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [40]:
df_prods_clean.shape

(49677, 4)

In [41]:
df_prods.dropna(inplace = True)

In [42]:
df_prods.dropna(subset = ['product_name'], inplace = True)

# 05. Duplicates

In [43]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [44]:
df_dups

,product_name,aisle_id,department_id,prices
product_id,,,,
462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18458,Ranger IPA,27,5,9.2
26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35491,Adore Forever Body Wash,127,11,9.9

In [45]:
# Addressing Duplicates
df_prods_clean.shape

(49677, 4)

In [46]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [47]:
df_prods_clean_no_dups.shape

(49672, 4)

In [48]:
df_ords

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [49]:
# 2.Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret 
# the output of this function, share in a markdown cell whether anything about the data looks off 
# or should be investigated further.
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [50]:
# orders_day_of_week max value should not be above 7

In [51]:
# 3. Check for mixed-type data in your df_ords dataframe.
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [52]:
# 4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.
# No mixed-type column found

In [53]:
# 5.Run a check for missing values in your df_ords dataframe
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [54]:
df_ords.shape

(3421083, 6)

In [55]:
# The days_since_prior_order missing values maching the user_id values. 
# Since each user had first order this makes sence.

In [56]:
# 6. Address the missing values using an appropriate method
df_nan_ords = df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [57]:
df_nan_ords

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [58]:
# I falgged the missing values. Since all of them seems to be the first order of users this makes sence.
df_clean_ords = df_ords
df_clean_ords['new_customer'] = df_ords['days_since_prior_order'].isnull() == True
df_clean_ords

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0,False
3421079,1854736,206209,11,4,10,30.0,False
3421080,626363,206209,12,1,12,18.0,False
3421081,2977660,206209,13,1,12,7.0,False
3421082,272231,206209,14,6,14,30.0,False

In [59]:
# 7. Run a check for duplicate values in your df_ords data
df_ords.duplicated()

0          False
1          False
2          False
3          False
4          False
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Length: 3421083, dtype: bool

In [60]:
df_dups_ords = df_ords[df_ords.duplicated()]

In [61]:
df_dups_ords

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, new_customer]
Index: []

In [62]:
# no duplicates found.

In [63]:
# 8. Address the duplicates using an appropriate method.
# In a markdown cell, explain why you used your method of choice - no duplicates found

# Tidying Up and Exporting Changes

In [64]:
df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'prods_checked.csv'))

In [65]:
df_clean_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked2.csv'))

In [66]:
df_nan_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'ords_first_orders.csv'))